       IDENTIFICATION DIVISION.
           PROGRAM-ID.		EX03.
           AUTHOR.		CLEDIR JUSTO.
           INSTALLATION.	FATEC-SP.
           DATE-WRITTEN.	03/03/2013.
           DATE-COMPILED.
           SECURITY.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.		IBM-PC.
       OBJECT-COMPUTER.		IBM-PC.
       SPECIAL-NAMES.		DECIMAL-POINT IS COMMA.	

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADALU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADATU ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CADALU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADALU.DAT".
		   
       01 REG-ENT.
           02 NUMERO		PIC 9(05).
           02 NOME		PIC X(20).
           02 NOTA1		PIC 9(02)V99.
           02 NOTA2		PIC 9(02)V99.
           02 NOTA3		PIC 9(02)V99.
           		   
       FD CADATU
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADATU.DAT".
		   
       01 REG-SAI.
           02 NUMERO-SAI	PIC 9(05).
           02 MEDIA-SAI		PIC 9(02)V99.
		   
           WORKING-STORAGE SECTION.
           77 FIM-ARQ		PIC X(03) VALUE "NAO".
           77 SOMA-NOTAS	PIC 9(02)V9(02) VALUE ZEROS.
           77 MEDIAFINAL	PIC 99V99 VALUE ZEROS.

       PROCEDURE DIVISION.
	   
       PGM-EX03.
           PERFORM INICIO.
           PERFORM PRINCIPAL
             UNTIL FIM-ARQ EQUAL "SIM".
             
           PERFORM TERMINO.

       STOP RUN.

       INICIO.

           OPEN INPUT CADALU
                OUTPUT CADATU.
           PERFORM LEITURA.

       LEITURA.
           READ CADALU
           AT END
           MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM CALCMEDIA.
           PERFORM GRAVACAO.
           PERFORM LEITURA.

       CALCMEDIA.
           ADD NOTA1 NOTA2 NOTA3 GIVING SOMA-NOTAS.
           DIVIDE SOMA-NOTAS BY 3 GIVING MEDIAFINAL.

       GRAVACAO.
           MOVE NUMERO TO NUMERO-SAI.
           MOVE MEDIAFINAL TO MEDIA-SAI.
           WRITE REG-SAI.

       TERMINO.
           CLOSE   CADALU
                   CADATU.
