       IDENTIFICATION DIVISION.
       PROGRAM-ID.	EX04.
       AUTHOR.          CLEDIR JUSTO.
       INSTALLATION.   	FATEC-SP.
       DATE-WRITTEN.   	27/04/2013.
       DATE-COMPILED.
       SECURITY. APENAS O AUTOR PODE MODIFICA-LO.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-PC.
       OBJECT-COMPUTER. IBM-PC.
       SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADESTOQ ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT RELESTOQ ASSIGN TO DISK.

       DATA DIVISION.
       FILE SECTION.

       FD  CADESTOQ
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADESTOQ.DAT".
       01  REG-CLI.
           02 CODIGO	  	PIC 9(05).
           02 NOME	  	PIC X(15).
           02 QTD-ESTOQUE 	PIC 9(5).
           02 PRECO	  	PIC 9(6)V99.
  
       FD  RELESTOQ
           LABEL RECORD IS OMITTED.
       01  REG-ATR     PIC X(80).

       WORKING-STORAGE SECTION.
       77  FIM-ARQ     PIC X(03) VALUE "NAO".
       77  CT-LIN      PIC 9(02) VALUE 25.
       77  CT-PAG      PIC 9(02) VALUE ZEROES.
       77  CUSTOTOT    PIC 9(07)V9(02) VALUE ZEROES.
       77  QTDTOTAL    PIC 9(07) VALUE ZEROES.
       77  PRECOTOTAL  PIC 9(08)V9(02) VALUE ZEROES.
       77  PRECOMEDIO  PIC 9(06)V9(02) VALUE ZEROES.


       01 CAB-01.
          02 FILLER    PIC X(08) VALUE "27/04/13".
          02 FILLER    PIC X(05) VALUE SPACES.
          02 FILLER    PIC X(22) VALUE "RELATORIO DE MATERIAL ".
          02 FILLER    PIC X(10) VALUE "EM ESTOQUE".
          02 FILLER    PIC X(20) VALUE SPACES.
          02 FILLER    PIC X(05) VALUE "PAG. ".
          02 VAR-PAG   PIC 99.
          02 FILLER    PIC X(03) VALUE SPACES.

       01 CAB-02.
          02 FILLER    PIC X(6)  VALUE "CODIGO".
          02 FILLER    PIC X(5) VALUE SPACES.
          02 FILLER    PIC X(4)  VALUE "NOME".
          02 FILLER    PIC X(17) VALUE SPACES.
          02 FILLER    PIC X(06) VALUE "QTD DO".
          02 FILLER    PIC X(5)  VALUE SPACES.
          02 FILLER    PIC X(14) VALUE "CUSTO UNITARIO".
          02 FILLER    PIC X(5)  VALUE SPACES.
          02 FILLER    PIC X(11) VALUE "CUSTO TOTAL".


       01 CAB-03.
          02 FILLER    PIC X(32) VALUE SPACES.
          02 FILLER    PIC X(07) VALUE "ESTOQUE".
          02 FILLER    PIC X(41) VALUE SPACES.

       01 CAB-04.
          02 FILLER    PIC X(05) VALUE SPACES.
          02 FILLER    PIC X(16) VALUE "QUANTIDADE TOTAL".
          02 FILLER    PIC X(16) VALUE SPACES.
          02 FILLER    PIC X(11) VALUE "PRECO MEDIO".
          02 FILLER    PIC X(17) VALUE SPACES.
          02 FILLER    PIC X(11) VALUE "PRECO TOTAL".

       01 CAB-05.
          02 FILLER    PIC X(10) VALUE SPACES.
          02 QTDTOTA   PIC 9(07).
          02 FILLER    PIC X(20) VALUE SPACES.
          02 PRECOMEDI PIC 9(06)V9(02).
          02 FILLER    PIC X(20) VALUE SPACES.
          02 PRECOTOTA  PIC 9(08)V9(02).
       
    
       01 DETALHE.
          02 COD       PIC 9(05).
          02 FILLER    PIC X(06) VALUE SPACES.
          02 NOM       PIC X(15).
          02 FILLER    PIC X(6) VALUE SPACES.
          02 QTDEST    PIC 9(5).
          02 FILLER    PIC X(10) VALUE SPACES.
          02 PREC      PIC 9(6)V99.
          02 FILLER    PIC X(10) VALUE SPACES.
          02 CUSTOTO   PIC 9(07)V9(02).

       
       PROCEDURE             DIVISION.
       
       PGM-EX04.
	  PERFORM INICIO.
	  PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
      	  PERFORM FIM.
	  STOP RUN.

       INICIO.
          OPEN INPUT  CADESTOQ
               OUTPUT RELESTOQ.
	  PERFORM LEITURA.

       LEITURA.
          READ CADESTOQ AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
          PERFORM IMPRESSAO.
	  PERFORM LEITURA.


       IMPRESSAO.
          IF CT-LIN GREATER THAN 24
	      PERFORM CABECALHO.
          PERFORM IMPDET.

       IMPDET.
          MOVE CODIGO TO COD.
          MOVE NOME TO NOM.
          MOVE QTD-ESTOQUE TO QTDEST.
          MOVE PRECO TO PREC.
          MULTIPLY PRECO BY QTD-ESTOQUE GIVING CUSTOTOT.
          MOVE CUSTOTOT TO CUSTOTO.         
          WRITE REG-ATR FROM DETALHE AFTER ADVANCING 1 LINE.
	  ADD 1 TO CT-LIN.
          ADD QTD-ESTOQUE TO QTDTOTAL.
          ADD CUSTOTOT TO PRECOTOTAL.

       CABECALHO.
	  ADD 1 TO CT-PAG.
	  MOVE CT-PAG TO VAR-PAG.
          MOVE SPACES TO REG-ATR.
          WRITE REG-ATR AFTER ADVANCING PAGE.
          WRITE REG-ATR FROM CAB-01 AFTER ADVANCING 1 LINE.
          WRITE REG-ATR FROM CAB-02 AFTER ADVANCING 3 LINES.
	  WRITE REG-ATR FROM CAB-03 AFTER ADVANCING 1 LINES.
	  MOVE ZEROES TO CT-LIN.


       FIM.
          DIVIDE PRECOTOTAL BY QTDTOTAL GIVING PRECOMEDIO.
           ADD 1 TO CT-PAG.
	  MOVE CT-PAG TO VAR-PAG.
          MOVE SPACES TO REG-ATR.
          WRITE REG-ATR AFTER ADVANCING PAGE.
          WRITE REG-ATR FROM CAB-01 AFTER ADVANCING 1 LINE.
          WRITE REG-ATR FROM CAB-04 AFTER ADVANCING 1 LINE.
          MOVE QTDTOTAl TO QTDTOTA.
          MOVE PRECOMEDIo TO PRECOMEDI.
          MOVE PRECOTOTAl TO PRECOTOTA.
          WRITE REG-ATR FROM CAB-05 AFTER ADVANCING 1 LINE.
          CLOSE CADESTOQ
                RELESTOQ.
                      
